{
  "register": {
    "title": "Register",
    "username": "Username",
    "email": "Email",
    "phone": "Phone",
    "password": "Password",
    "confirmPassword": "Confirm Password",
    "profilePicture": "Profile Picture",
    "submit": "Register",
    "submitting": "Registering...",
    "chooseFile": "Choose file",
    "noFileChosen": "No file chosen",
    "successTitle": "Registration Successful!",
    "successMessage": "Your account has been created successfully.",
    "terms": {
      "viewTerms": "Terms of Service & Privacy Policy",
      "agree": "I agree to the Terms of Service and Privacy Policy",
      "required": "You must agree to the terms of service",
      "tosTitle": "Terms of Service – DD",
      "tosIntro": "Welcome to DD – an app that provides daily content (\"daily cards\") for personal improvement, inspiration, and spiritual and emotional growth. Using the app constitutes agreement to the terms detailed below.",
      "s1Title": "1. Purpose of the Service",
      "s1Body": "The app is intended for personal use only and allows users to receive daily content, follow creators, and view unique cards. The service is provided \"as is\" (AS IS), with no liability for content, availability, or results of use.",
      "s2Title": "2. User Account",
      "s2Body": "An account must be created using email or other sign-in methods. The user agrees to provide accurate, complete, and up-to-date information. DD management reserves the right to suspend or delete a user account at any time if used in violation of these terms.",
      "s3Title": "3. Minimum Age",
      "s3Body": "The service is intended for users aged 13 and above. If the user is under 13, parental or guardian consent is required to use the app.",
      "s4Title": "4. Intellectual Property",
      "s4Body": "All content in the app – including text, designs, images, videos, logo, and the DD brand name – is protected by copyright. No part of the app may be copied, distributed, reproduced, or used commercially without prior written approval from DD management.",
      "s5Title": "5. User-Generated Content",
      "s5Body": "Users may submit content such as cards or suggestions. By uploading content, the user confirms they are the legal owner of the material and grants DD a free license to use it for display or promotional purposes. DD may remove offensive, inappropriate, or copyright-infringing content.",
      "s6Title": "6. Push Notifications",
      "s6Body": "The app may send daily notifications with new content or updates. Notifications can be disabled at any time through device settings.",
      "s7Title": "7. Payments",
      "s7Body": "The app is free to use. If paid content or services are added in the future, this will be clearly communicated before any charges.",
      "s8Title": "8. External Links and Content",
      "s8Body": "Links to external websites may be displayed. DD is not responsible for the content, reliability, or privacy policies of these sites.",
      "s9Title": "9. Liability and Indemnification",
      "s9Body": "The service is provided \"As-Is\". DD is not liable for any direct or indirect damages resulting from use. The user agrees to indemnify DD for any damage or claim arising from use in violation of the terms.",
      "s10Title": "10. Changes and Service Discontinuation",
      "s10Body": "DD reserves the right to modify, update, or discontinue the service at any time without prior notice. Changes to terms take effect upon publication in the app.",
      "s11Title": "11. Governing Law",
      "s11Body": "The governing law is the law of the State of Israel. Exclusive jurisdiction is held by the courts of Tel Aviv-Jaffa.",
      "privacyTitle": "Privacy Policy – DD",
      "privacyIntro": "This policy explains how we collect, store, and use information from DD users.",
      "p1Title": "1. Information Collected",
      "p1Items": ["Identification details (name, email, user ID)", "Usage data (cards viewed, preferences, usage times)", "Device identifiers (Device ID, Expo Push Token)", "System details (IP, device type, OS version)"],
      "p2Title": "2. Purpose of Information Use",
      "p2Items": ["Operating the service and personalization", "Sending notifications and daily content (with consent)", "Improving user experience", "Information security and abuse prevention"],
      "p3Title": "3. Data Storage and Security",
      "p3Body": "Data is stored on secure servers such as Render and MongoDB Atlas. DD does not sell personal information or transfer it to third parties unless required by law.",
      "p4Title": "4. Permissions",
      "p4Intro": "The app may request:",
      "p4Items": ["Notifications (daily content)", "Internet (data loading)", "Storage/Camera (for future content uploads)"],
      "p4Outro": "Permissions can be revoked through device settings.",
      "p5Title": "5. User Rights",
      "p5Items": ["View stored personal data", "Request data deletion/update", "Request account closure"],
      "p5Contact": "Inquiries and support: 055-3045229",
      "p6Title": "6. External Links",
      "p6Body": "The app may contain links to other websites. DD is not responsible for their privacy policies or content.",
      "p7Title": "7. Policy Changes",
      "p7Body": "DD may update from time to time. Significant changes will appear in the app or be sent by email. Last updated: October 16, 2025"
    },
    "errors": {
      "usernameRequired": "Username is required",
      "usernameMin": "Username must be at least 3 characters",
      "usernameMax": "Username cannot exceed 40 characters",
      "emailRequired": "Email is required",
      "emailInvalid": "Invalid email address",
      "phoneMin": "Phone must be at least 8 digits",
      "passwordRequired": "Password is required",
      "passwordMin": "Password must be at least 6 characters",
      "passwordMax": "Password cannot exceed 40 characters",
      "confirmPasswordRequired": "Confirm password is required",
      "passwordsMustMatch": "Passwords do not match",
      "submitFailed": "Registration failed. Please try again."
    }
  },
  "verify": {
    "title": "Please Verify Your Account",
    "subtitle": "Enter the code sent to your email",
    "submit": "Verify Your Account",
    "submitting": "Verifying...",
    "errors": {
      "codeRequired": "Please enter all 6 digits",
      "submitFailed": "Verification failed. Please try again."
    }
  }
}
